from collections import Counter

def f(s):
    #узнаем кол-во каждого символа -=-=-=-=-=-=-=-=-=-=-=-=-=-
    counter = Counter(s)
    #отдельно для слеша
    n = counter['/'] #кол-во пар тегов,
                        #которые мы можем создать

    #проверкка кол-во скобок -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
    for brac in '<>':
        #сколько открылось, столько и закрылось
        #<> <> /
        if counter[brac] != 2 * n:
            return 'Impossible'

    #проверка кол-во букв -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
    stack = []
    for c in counter:
        #если это буква
        if c.isalpha():
            cnt = counter[c]
            #каждая буква должна иметь пару
            if cnt % 2 != 0:
                return 'Impossible'
        #добавим эту букву столько раз,
        #сколько мы можем её использовать
        #не учитывая повтор
        stack += [c] * (cnt // 2)

    #проверка хватит ли слешей на буквы -=-=-=-=-=--=-=-=-=-
    #если нечем закрывать нет слешей
    #если стек-букв меньше, чем кол-во слешей
    if n == 0 or len(stack) < n:
        return 'Impossible'

    #сборка текста для тегов -=-=-=-=-=-=-=-=-=--=-=-=-=-=-=
    #приклеить в конец всех кому не хватило слеша
    stack[n-1] = ''.join(stack[n-1:])
    #отрезать их
    stack = stack[:n]

    #собрать строку -=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-
    reversed_stack = reversed(stack)
    #создать открывающие теги
    stack = ['<' + tok + '>' for tok in stack]
    #закрывающие
    reversed_stack = ['</' + tok + '>' for tok in reversed_stack]
    #соеденить
    stack.extend(reversed_stack)
    return ''.join(stack)











