import sys
from collections import deque

def main():
    #stdin - вместо input
    #buffer - читать по байтам
    #read - прочитать
    data = sys.stdin.buffer.read().split()

    #считаем данные -=-=-=-=-=-=-=--=-=-=-=-=-=-=-=-=-
    #кол-во команд
    n = int(data[0])
    #команды
    a = list(map(int, data[1:1 + n]))
    #кол-во считалок
    q = int(data[1 + n])
    #считалки
    ks = data[2 + n:2 + n + q]

    #найдем чемпиона, после n-1 матчей -=-=-=-=-=-=-=-
    #начнется цикл
    dq = deque(a) #очередь из команд
    #предпологаемый чемпион
    first = dq.popleft()
    #пары команд, которые играли
    match = []
    for _ in range(n - 1):
        enemy = dq.popleft()
        #запишем
        match.append((first, enemy))
        #выберем победителя
        if first > enemy:
            #проиграл в конец
            dq.append(enemy)
        else:
            #проиграл в конец
            dq.append(first)
            #победитель новый кандидат
            first = enemy

    #порядок команд, которые будут бесконечно
    #играть с победителем в текущем порядке
    rest = list(dq)
    m = n - 1 #кол-во оставшихся команд

    #ответ для каждой считалочки =--=-=-=-=-=-=-=-=-=-
    out = []
    for k_raw in ks:
        #текущая
        k = int(k_raw)
        #до определения победителя
        if k <= n - 1:
            x, y = match[k - 1]
        #после определения
        else:
            x = first #игра всегда с победителем
            #узнать сколько матчей осталось после
            #опеределения победителя
            #после берем по кол-ву команд
            #сколько осталось такой и индекс
            #пример [5 2 1]
            #осталось 2 команды
            #ходов 5
            #3 - 1 -> цикл после 2 ходов
            #осталось (5 - 2) -> 3 хода
            #цикл один раз 3 - 2 -> остался один
            #значит ответ команда '2'
            y = rest[(k - n) % m]
        out.append(f"{x} {y}")
    sys.stdout.write("\n".join(out) + "\n")

main()