#главные свойства xor
#a ^ a = 0
#a ^ 0 = a
#совпадающие числа исчезнут и
#останется только недостающее

def f(nums):
    n = len(nums) #количество чисел
    #сразу запишем последнее число в результат
    res = n #последнее число (3)

    #нам нужно сделать xor операцию с
    #индексами и имеющимися числами
    #неважно в каком порядке
    #собрать всё в выражение
    #(индекс)^(число из списка)
    #3 ^0^0 ^1^1 ^2^3
    #если поменять местами, то получатся пары
    #0^0 ^ 1^1 ^ 3^3 ^ 2
    #двойка без пары она и станет ответом
    for i in range(n):#0, 1, 2
        cur = nums[i]
        res = res ^ i #нужное
        res = res ^ cur #текущее
    return res

print(f([0, 1, 3]))


